# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0 320x320x32
   [-1, 1, Conv, [128, 3, 2]],  # 1  160x160x64
   [-1, 3, C2f_ContextGuided, [128, True]],   #2  160x160x64
   [1,1,TR1,[64,64]],         #3 80x80x128
   [2, 1, Conv, [256, 3, 2]],  # 4  80x80x64
   [-1, 6, C2f_ContextGuided, [256, True]],    #5 80x80x128
   [[3, 5], 1, Concat_a, [1,256]],#6  80x80x256
   [3,1,TR1,[128,128]],         #7  40x40x256
   [6, 1, Conv30, [512, 3, 2]],  # 8  40x40x256
   [-1, 6, C2f_ContextGuided, [512, True]],    #9  40x40x256
   [[7, 9], 1, Concat_a, [1,512]],  #10 40x40x512
   [7,1,TR1,[256,256]],        #11 20x20x512
   [10, 1, Conv40, [1024, 3, 2]],  #12  20x20x512
   [-1, 6, C2f_ContextGuided, [1024, True]],     #13   20x20x512
   [[11, 13], 1, Concat_b, [1,1024]],#14  20x20x1024
   [-1, 1, SPPF, [2048, 5]],  # 15 20x20x1024
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C2f_ContextGuided, [512]],  # 19

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C2f_ContextGuided, [256]],  # 23 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 20], 1, Concat, [1]],  # cat head P4
   [-1, 3, C2f_ContextGuided, [512]],  # 26 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat head P5
   [-1, 3, C2f_ContextGuided  , [1024]],  # 29 (P5/32-large)

   [[23, 26, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
